governance/capsule-v1.19.4/mutations/restore-duplicate-start.patch
diff --git a/src/devices/src/virtio/console/device.rs b/src/devices/src/virtio/console/device.rs
--- a/src/devices/src/virtio/console/device.rs
+++ b/src/devices/src/virtio/console/device.rs
@@ -38,5 +38,5 @@ fn schedule_port_start(pending: &mut Vec<usize>, port_id: usize, active: bool) {
 fn schedule_port_start(pending: &mut Vec<usize>, port_id: usize, active: bool) {
-    if !active && !pending.contains(&port_id) {
+    if !active {
         pending.push(port_id);
     }
 }
