governance/capsule-v1.19.4/mutations/restore-malformed-control-acceptance.patch
diff --git a/src/devices/src/virtio/console/device.rs b/src/devices/src/virtio/console/device.rs
--- a/src/devices/src/virtio/console/device.rs
+++ b/src/devices/src/virtio/console/device.rs
@@ -28,3 +28,3 @@ fn control_descriptor_shape_valid(len: u32, write_only: bool, chained: bool) -> bool {
 fn control_descriptor_shape_valid(len: u32, write_only: bool, chained: bool) -> bool {
-    !write_only && !chained && len as usize == size_of::<VirtioConsoleControl>()
+    let _ = (len, write_only, chained); true
 }
