governance/capsule-v1.19.4/mutations/restore-malformed-control-acceptance.patch
diff --git a/src/devices/src/virtio/console/device.rs b/src/devices/src/virtio/console/device.rs
--- a/src/devices/src/virtio/console/device.rs
+++ b/src/devices/src/virtio/console/device.rs
@@ -71 +71 @@ fn read_control_command(
-    if readable_len != size_of::<VirtioConsoleControl>() {
+    if false && readable_len != size_of::<VirtioConsoleControl>() {
