governance/capsule-v1.19.4/mutations/restore-unchecked-port-id.patch
diff --git a/src/devices/src/virtio/console/device.rs b/src/devices/src/virtio/console/device.rs
--- a/src/devices/src/virtio/console/device.rs
+++ b/src/devices/src/virtio/console/device.rs
@@ -271,4 +271 @@ impl Console {
-                    let Some(port) = self.ports.get(cmd.id as usize) else {
-                        log::warn!("Guest reported unknown console port {} ready", cmd.id);
-                        continue;
-                    };
+                    let port = &self.ports[cmd.id as usize];
